package com.example.myclosetapp.activities;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.TextView;
import android.widget.Toast;

import com.example.myclosetapp.R;
import com.example.myclosetapp.data.InstructionItem;

import java.util.ArrayList;
import java.util.List;

public class InstructionsActivity extends AppCompatActivity {
    private List<InstructionItem> instructionsList;
    private ImageView instructionsImage;
    private TextView instructionsText;
    private Button nextInstruction;
    private Button previousInstruction;
    private int count ;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_instructions);

        nextInstruction=findViewById(R.id.button_change_instruction_next);
        previousInstruction=findViewById(R.id.button_change_instruction_previous);
        instructionsImage=findViewById(R.id.instructionsImageView);
        instructionsText=findViewById(R.id.instructionsTextView);

        count=0;
        instructionsList = new ArrayList<>();
        instructionsList.add(new InstructionItem(R.drawable.help_image_1,"Η εφαρμογή δίνει την επιλογή στον χρήστη να κάνει σύνδεση είτε  μέσω του προσωπικού του λογαριασμού facebook είτε μέσω του SecurityBypass"));
        instructionsList.add(new InstructionItem(R.drawable.help_image_2,"Καθώς ο χρήστης κάνει είσοδο στην εφαρμογή εμφανίζεται η  αρχική οθόνη της εφαρμογής στην οποία αποθηκεύονται τα ρούχα. Στην περίπτωση που είναι κενή η αρχική οθόνη, εμφανίζεται κατάλληλο μήνυμα προσθήκης ρούχων."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_3,"Η αρχική οθόνη προσφέρει ένα button προσθήκης ρούχων το οποίο βρίσκεται κάτω δεξιά στην εφαρμογή (βλέπε βελάκι).Ο χρήστης όταν θέλει να  προσθέσει ρούχα πρέπει να πατήσει σε αυτό το βελάκι το οποίο θα τον παραπέμψει σε άλλη οθόνη της εφαρμογής."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        instructionsList.add(new InstructionItem(R.drawable.help_image_4,"O χρήστης μπορεί να προσθέσει ρούχα με δυο τρόπους. Είτε μέσω της κάμερας του τηλεφώνου του είτε μέσω της συλλογής φωτογραφιών του. Επίσης θα πρέπει να επιλέξει το χρώμα του ρούχου το οποίο προσφέρεται από την εφαρμογή μέσω μιας ποικιλίας χρωμάτων όπως επίσης και τον τύπο του ρούχου που πρόκειται να αποθηκευτεί. Σύμφωνα με τα βελάκι (1) ο χρήστης επιλεγεί να επιστρέψει στην αρχική οθόνη και να μην αποθηκεύσει κάποιο ρούχο ενώ με το βελάκι (2) ο χρήστης αποθηκεύει στην εφαρμογή το ρούχο που θέλει να προσθέσει."));
        getSupportActionBar();
        setTitle("Οδηγίες "+(count+1)+"/"+instructionsList.size());
        instructionsImage.setImageResource(instructionsList.get(count).getImage());
        instructionsText.setText(instructionsList.get(count).getDescription());

        nextInstruction.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                if(count<instructionsList.size()-1){
                    count+=1;
                    instructionsImage.setImageResource(instructionsList.get(count).getImage());
                    instructionsText.setText(instructionsList.get(count).getDescription());
                    setTitle("Οδηγίες "+(count+1)+"/"+instructionsList.size());
                }
                else {
                    Toast.makeText(InstructionsActivity.this,"Δεν υπάρχουν άλλες οδηγίες",Toast.LENGTH_SHORT).show();
                }


            }
        });

        previousInstruction.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                if(count>0){
                    count-=1;
                    instructionsImage.setImageResource(instructionsList.get(count).getImage());
                    instructionsText.setText(instructionsList.get(count).getDescription());
                    setTitle("Οδηγίες "+(count+1)+"/"+instructionsList.size());
                }
                else {
                    Toast.makeText(InstructionsActivity.this,"Δεν υπάρχουν άλλες οδηγίες",Toast.LENGTH_SHORT).show();
                }
            }
        });

    }
}
